app/Http/Controllers/MahasiswaController.php

    public function index()
    {
        $mahasiswa = Mahasiswa::all(); // Mengambil semua data mahasiswa
---
select * from `mahasiswa`